app/controllers/posts_controller.rb

  def index
    #provide a list of authors to the view for the filter control
    @authors = Author.all

    #filter the @posts list based on user input - this is the logic used to get the filter in posts/index
    #this is filtering by author
    if !params[:author].blank?
      #@posts = Post.where(author: params[:author])
      #Post.by_author is a method in the model
      @posts = Post.by_author(params[:author])
    #this is filtering by date
    elsif !params[:date].blank?
      if params[:date] == "Today"
      #@posts = Post.where("created_at >=?", Time.zone.today.beginning_of_day)
      @posts = Post.from_today
      else
      #@posts = Post.where("created_at <?", Time.zone.today.beginning_of_day)
      @posts = Post.old_news
      end
    else
      #if no filters are applied, show all posts
      @posts = Post.all
---
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')